docs/evidence/perf/win-cache-off.txt
# ===== 캐시 OFF (SPRING_CACHE_TYPE=none) =====
# 일시   : 2026-08-08 17:12:41 +0900
# 커밋   : 324897e09c549677af0d50c904e5ba8f7ba5a675  작업트리: dirty
# 구성   : 단일 인스턴스 (docker-compose.yml), SPRING_CACHE_TYPE=none
# ★ 앱 재기동으로 DB 를 이 측정 직전에 초기화했다 (ddl-auto=create)
# 시나리오: load.js VUS=50 DURATION=45s
# ===============================

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /perf/load.js
        output: -

     scenarios: (100.00%) 2 scenarios, 55 max VUs, 1m40s max duration (incl. graceful stop):
              * warmup: 5 looping VUs for 20s (exec: traffic, gracefulStop: 30s)
              * measure: 50 looping VUs for 45s (exec: traffic, startTime: 25s, gracefulStop: 30s)


Run       [ 100% ] setup()
warmup    [   0% ]
measure   [   0% ]

Run       [ 100% ] setup()
warmup    [   0% ]
measure   [   0% ]

Run       [ 100% ] setup()
warmup    [   0% ]
measure   [   0% ]

Run       [ 100% ] setup()
warmup    [   0% ]
measure   [   0% ]

Run       [ 100% ] setup()
warmup    [   0% ]
measure   [   0% ]

Run       [ 100% ] setup()
warmup    [   0% ]
measure   [   0% ]

running (0m07.0s), 05/55 VUs, 15 complete and 0 interrupted iterations
warmup    [   3% ] 5 VUs    00.6s/20s
measure • [   0% ] waiting  24.4s

running (0m08.0s), 05/55 VUs, 50 complete and 0 interrupted iterations
warmup    [   8% ] 5 VUs    01.6s/20s
measure • [   0% ] waiting  23.4s

running (0m09.0s), 05/55 VUs, 85 complete and 0 interrupted iterations
warmup    [  13% ] 5 VUs    02.6s/20s
measure • [   0% ] waiting  22.4s

running (0m10.0s), 05/55 VUs, 120 complete and 0 interrupted iterations
warmup    [  18% ] 5 VUs    03.6s/20s
measure • [   0% ] waiting  21.4s

running (0m11.0s), 05/55 VUs, 160 complete and 0 interrupted iterations
warmup    [  23% ] 5 VUs    04.6s/20s
measure • [   0% ] waiting  20.4s

running (0m12.0s), 05/55 VUs, 200 complete and 0 interrupted iterations
warmup    [  28% ] 5 VUs    05.6s/20s
measure • [   0% ] waiting  19.4s

running (0m13.0s), 05/55 VUs, 240 complete and 0 interrupted iterations
warmup    [  33% ] 5 VUs    06.6s/20s
measure • [   0% ] waiting  18.4s

running (0m14.0s), 05/55 VUs, 283 complete and 0 interrupted iterations
warmup    [  38% ] 5 VUs    07.6s/20s
measure • [   0% ] waiting  17.4s

running (0m15.0s), 05/55 VUs, 325 complete and 0 interrupted iterations
warmup    [  43% ] 5 VUs    08.6s/20s
measure • [   0% ] waiting  16.4s

running (0m16.0s), 05/55 VUs, 366 complete and 0 interrupted iterations
warmup    [  48% ] 5 VUs    09.6s/20s
measure • [   0% ] waiting  15.4s

running (0m17.0s), 05/55 VUs, 409 complete and 0 interrupted iterations
warmup    [  53% ] 5 VUs    10.6s/20s
measure • [   0% ] waiting  14.4s

running (0m18.0s), 05/55 VUs, 451 complete and 0 interrupted iterations
warmup    [  58% ] 5 VUs    11.6s/20s
measure • [   0% ] waiting  13.4s

running (0m19.0s), 05/55 VUs, 494 complete and 0 interrupted iterations
warmup    [  63% ] 5 VUs    12.6s/20s
measure • [   0% ] waiting  12.4s

running (0m20.0s), 05/55 VUs, 536 complete and 0 interrupted iterations
warmup    [  68% ] 5 VUs    13.6s/20s
measure • [   0% ] waiting  11.4s

running (0m21.0s), 05/55 VUs, 579 complete and 0 interrupted iterations
warmup    [  73% ] 5 VUs    14.6s/20s
measure • [   0% ] waiting  10.4s

running (0m22.0s), 05/55 VUs, 621 complete and 0 interrupted iterations
warmup    [  78% ] 5 VUs    15.6s/20s
measure • [   0% ] waiting  09.4s

running (0m23.0s), 05/55 VUs, 665 complete and 0 interrupted iterations
warmup    [  83% ] 5 VUs    16.6s/20s
measure • [   0% ] waiting  08.4s

running (0m24.0s), 05/55 VUs, 707 complete and 0 interrupted iterations
warmup    [  88% ] 5 VUs    17.6s/20s
measure • [   0% ] waiting  07.4s

running (0m25.0s), 05/55 VUs, 751 complete and 0 interrupted iterations
warmup    [  93% ] 5 VUs    18.6s/20s
measure • [   0% ] waiting  06.4s

running (0m26.0s), 05/55 VUs, 795 complete and 0 interrupted iterations
warmup    [  98% ] 5 VUs    19.6s/20s
measure • [   0% ] waiting  05.4s

running (0m27.0s), 00/55 VUs, 816 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs    20s
measure • [   0% ] waiting  04.4s

running (0m28.0s), 00/55 VUs, 816 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs    20s
measure • [   0% ] waiting  03.4s

running (0m29.0s), 00/55 VUs, 816 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs    20s
measure • [   0% ] waiting  02.4s

running (0m30.0s), 00/55 VUs, 816 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs    20s
measure • [   0% ] waiting  01.4s

running (0m31.0s), 00/55 VUs, 816 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs    20s
measure • [   0% ] waiting  00.4s

running (0m32.0s), 50/55 VUs, 950 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [   1% ] 50 VUs  00.6s/45s

running (0m33.0s), 50/55 VUs, 1301 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [   3% ] 50 VUs  01.6s/45s

running (0m34.0s), 50/55 VUs, 1686 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [   6% ] 50 VUs  02.6s/45s

running (0m35.0s), 50/55 VUs, 2054 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [   8% ] 50 VUs  03.6s/45s

running (0m36.0s), 50/55 VUs, 2449 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  10% ] 50 VUs  04.6s/45s

running (0m37.0s), 50/55 VUs, 2842 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  12% ] 50 VUs  05.6s/45s

running (0m38.0s), 50/55 VUs, 3250 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  15% ] 50 VUs  06.6s/45s

running (0m39.0s), 50/55 VUs, 3653 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  17% ] 50 VUs  07.6s/45s

running (0m40.0s), 50/55 VUs, 4066 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  19% ] 50 VUs  08.6s/45s

running (0m41.0s), 50/55 VUs, 4489 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  21% ] 50 VUs  09.6s/45s

running (0m42.0s), 50/55 VUs, 4921 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  23% ] 50 VUs  10.6s/45s

running (0m43.0s), 50/55 VUs, 5356 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  26% ] 50 VUs  11.6s/45s

running (0m44.0s), 50/55 VUs, 5783 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  28% ] 50 VUs  12.6s/45s

running (0m45.0s), 50/55 VUs, 6222 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  30% ] 50 VUs  13.6s/45s

running (0m46.0s), 50/55 VUs, 6563 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  32% ] 50 VUs  14.6s/45s

running (0m47.0s), 50/55 VUs, 6990 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  35% ] 50 VUs  15.6s/45s

running (0m48.0s), 50/55 VUs, 7430 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  37% ] 50 VUs  16.6s/45s

running (0m49.0s), 50/55 VUs, 7864 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  39% ] 50 VUs  17.6s/45s

running (0m50.0s), 50/55 VUs, 8289 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  41% ] 50 VUs  18.6s/45s

running (0m51.0s), 50/55 VUs, 8724 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  43% ] 50 VUs  19.6s/45s

running (0m52.0s), 50/55 VUs, 9161 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  46% ] 50 VUs  20.6s/45s

running (0m53.0s), 50/55 VUs, 9591 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  48% ] 50 VUs  21.6s/45s

running (0m54.0s), 50/55 VUs, 10026 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  50% ] 50 VUs  22.6s/45s

running (0m55.0s), 50/55 VUs, 10456 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  52% ] 50 VUs  23.6s/45s

running (0m56.0s), 50/55 VUs, 10898 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  55% ] 50 VUs  24.6s/45s

running (0m57.0s), 50/55 VUs, 11326 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  57% ] 50 VUs  25.6s/45s

running (0m58.0s), 50/55 VUs, 11760 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  59% ] 50 VUs  26.6s/45s

running (0m59.0s), 50/55 VUs, 12193 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  61% ] 50 VUs  27.6s/45s

running (1m00.0s), 50/55 VUs, 12613 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  63% ] 50 VUs  28.6s/45s

running (1m01.0s), 50/55 VUs, 13027 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  66% ] 50 VUs  29.6s/45s

running (1m02.0s), 50/55 VUs, 13455 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  68% ] 50 VUs  30.6s/45s

running (1m03.0s), 50/55 VUs, 13861 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  70% ] 50 VUs  31.6s/45s

running (1m04.0s), 50/55 VUs, 14300 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  72% ] 50 VUs  32.6s/45s

running (1m05.0s), 50/55 VUs, 14730 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  75% ] 50 VUs  33.6s/45s

running (1m06.0s), 50/55 VUs, 15164 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  77% ] 50 VUs  34.6s/45s

running (1m07.0s), 50/55 VUs, 15595 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  79% ] 50 VUs  35.6s/45s

running (1m08.0s), 50/55 VUs, 15897 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  81% ] 50 VUs  36.6s/45s

running (1m09.0s), 50/55 VUs, 16329 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  83% ] 50 VUs  37.6s/45s

running (1m10.0s), 50/55 VUs, 16771 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  86% ] 50 VUs  38.6s/45s

running (1m11.0s), 50/55 VUs, 17207 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  88% ] 50 VUs  39.6s/45s

running (1m12.0s), 50/55 VUs, 17620 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  90% ] 50 VUs  40.6s/45s

running (1m13.0s), 50/55 VUs, 18048 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  92% ] 50 VUs  41.6s/45s

running (1m14.0s), 50/55 VUs, 18489 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  95% ] 50 VUs  42.6s/45s

running (1m15.0s), 50/55 VUs, 18928 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  97% ] 50 VUs  43.6s/45s

running (1m16.0s), 50/55 VUs, 19186 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  99% ] 50 VUs  44.6s/45s


  █ THRESHOLDS 

    checks{phase:measure}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{phase:measure}
    ✓ 'p(95)<500' p(95)=12.4ms

    http_req_failed{phase:measure}
    ✗ 'rate<0.01' rate=2.37%


  █ TOTAL RESULTS 

    checks_total.......: 155368  2030.324902/s
    checks_succeeded...: 100.00% 155368 out of 155368
    checks_failed......: 0.00%   0 out of 155368

    ✓ list 200
    ✓ list 비어있지 않음
    ✓ orders 200
    ✓ orders 인증됨
    ✓ orders 최소 건수
    ✓ order 처리됨

    CUSTOM
    resp_2xx.......................: 76017 993.378354/s
    resp_409_conflict..............: 1767  23.090882/s
    resp_error_coded...............: 1767  23.090882/s
    setup_requests.................: 100   1.306784/s

    HTTP
    http_req_duration..............: avg=5.08ms   min=69.9µs   med=2.27ms   p(95)=12.56ms  p(99)=28.49ms  max=326.02ms
      { expected_response:true }...: avg=4.96ms   min=69.9µs   med=2.23ms   p(95)=12.47ms  p(99)=28.15ms  max=326.02ms
      { phase:measure }............: avg=4.99ms   min=69.9µs   med=2.22ms   p(95)=12.4ms   p(99)=26.54ms  max=326.02ms
    http_req_failed................: 2.27% 1767 out of 77784
      { phase:measure }............: 2.37% 1767 out of 74420
    http_reqs......................: 77784 1016.469235/s

    EXECUTION
    iteration_duration.............: avg=121.14ms min=107.89ms med=116.08ms p(95)=139.01ms p(99)=220.85ms max=571.75ms
    iterations.....................: 19421 253.790613/s
    vus............................: 50    min=0             max=50
    vus_max........................: 55    min=55            max=55

    NETWORK
    data_received..................: 81 MB 1.1 MB/s
    data_sent......................: 17 MB 215 kB/s



running (1m16.5s), 00/55 VUs, 19421 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure ✓ [ 100% ] 50 VUs  45s
time="2026-08-08T08:13:58Z" level=error msg="thresholds on metrics 'http_req_failed{phase:measure}' have been crossed"